stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_hal_rcc.c
/**
  ******************************************************************************
  * @file    stm32wl3x_hal_rcc.c
  * @author  MCD Application Team
  * @brief   RCC HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Reset and Clock Control (RCC) peripheral:
  *           + Initialization and de-initialization functions
  *           + Peripheral Control functions
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                      ##### RCC specific features #####
  ==============================================================================
    [..]
      After reset the device is running from High Speed Internal oscillator
      (64 MHz RC oscillator) with Flash 1 wait state. All peripherals clock are off except internal
      SRAM, Flash and GPIO for SWD communication.

      (+) The prescaler is DIV 4
      (+) The clock for all peripherals is switched off, except the SRAM and FLASH and GPIO.
      (+) All GPIOs are in input mode, except the SWD pins which
          are assigned to be used for debug purpose.

    [..]
      Once the device started from reset, the user application has to:
      (+) Configure the clock source to be used to drive the System clock
          (if the application needs higher frequency/performance)
      (+) Configure the System clock frequency and Flash settings
      (+) Enable the clock for the peripheral(s) to be used
      (+) Configure the clock source(s) for peripherals which clocks are not
          always 16MHz or 32 MHz (SMPS, SPI3I2S)

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32wl3x_hal.h"

/** @addtogroup STM32WL3x_HAL_Driver
  * @{
  */

/** @defgroup RCC RCC
  * @brief RCC HAL module driver
  * @{
  */

#ifdef HAL_RCC_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @defgroup RCC_Private_Constants RCC Private Constants
  * @{
  */
#define HSE_TIMEOUT_VALUE          HSE_STARTUP_TIMEOUT
#define HSI_TIMEOUT_VALUE          (2U)    /* 2 ms (minimum Tick + 1)   */
#define LSI_TIMEOUT_VALUE          (2U)    /* 2 ms (minimum Tick + 1)   */
#define PLL_TIMEOUT_VALUE          (2U)    /* 2 ms (minimum Tick + 1)   */
#define LATENCY_TIMEOUT_VALUE      (2U)    /* 2 ms (minimum Tick + 1)   */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup RCC_Private_Macros RCC Private Macros
  * @{
  */

#define __MCO1_CLK_ENABLE()   __HAL_RCC_GPIOA_CLK_ENABLE()
#define MCO1_GPIO_PORT        GPIOA
#define MCO1_PIN              GPIO_PIN_5
#define MCO1_GPIO_AF          GPIO_AF0_MCO

#define __MCO2_CLK_ENABLE()   __HAL_RCC_GPIOA_CLK_ENABLE()
#define MCO2_GPIO_PORT        GPIOA
#define MCO2_PIN              GPIO_PIN_11
#define MCO2_GPIO_AF          GPIO_AF0_MCO

#define __MCO3_CLK_ENABLE()   __HAL_RCC_GPIOB_CLK_ENABLE()

#define MCO3_GPIO_PORT        GPIOB
#define MCO3_PIN              GPIO_PIN_14
#define MCO3_GPIO_AF          GPIO_AF3_MCO

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/** @defgroup RCC_Private_Variables RCC Private Variables
  * @{
  */


/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/** @defgroup RCC_Exported_Functions RCC Exported Functions
  * @{
  */

/** @defgroup RCC_Exported_Functions_Group1 Initialization and de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
  @verbatim
 ===============================================================================
           ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]
      This section provides functions allowing to configure the internal and external oscillators
      (HSE, HSI, LSE, LSI, PLL and MCO) and the System busses clocks (SYSCLK).

    [..] Internal/external clock and PLL configuration
         (+) HSI (high-speed internal): 64 MHz factory-trimmed RC used through
             the PLL as System clock source.

         (+) LSI (low-speed internal): 32 KHz low consumption RC used as IWDG, LPUART,
             RF system Auto-wakeup from DeepStop modes.
             clock source.

         (+) HSE (high-speed external): 48 MHz crystal oscillator.

         (+) LSE (low-speed external): 32.768 KHz oscillator used as IWDG, RTC, LPUART,
             RF system Auto-wakeup from DeepStop modes.

         (+) PLL (clocked by HSI, HSE) providing system clock.

         (+) MCO (microcontroller clock output): used to output HSI, HSE, SYSCLK,
             HSI64M_DIV2048, RC64MPLL clock (through a configurable prescaler) on PA5, PA11 & PB15 pins.

         -@- All the peripheral clocks have an always 16 MHz or 32 MHz to maintain fixed baud rate
             while system clock is switching from a frequency to another from the System clock (SYSCLK).
             An always 32 or 16 MHz requested by few peripherals like the MR_BLE radio IP for instance.
             An always 16 MHz requested by few peripherals like serial interfaces or like flash controller and
             MR_BLE radio IP (to have a fixed reference clock to manage delays).

           (+@) A programmable prescaled clock for I2S block, that can be 16 MHz / 32 MHz.
                You have to use @ref __HAL_RCC_SPI3I2S_CONFIG and @ref HAL_RCCEx_PeriphCLKConfig()
                function to configure this clock.

         (+) The maximum frequency of the SYSCLK is 64 MHz.

  @endverbatim

           Table 1. Flash Latency vs Clock frequency.
           +-------------------------------------------------------+
           | Wait State      |    System  clock frequency (MHz)    |
           |-----------------|-------------------------------------|
           |0WS(1 CPU cycles)|         SYSCLK < 38 MHz             |
           |-----------------|-------------------------------------|
           |1WS(2 CPU cycles)|         SYSCLK >= 38 MHz            |
           +-----------------+-------------------------------------+

  * @{
  */

/**
  * @brief  Reset the RCC clock configuration to the default reset state.
  * @note   The default reset state of the clock configuration is given below:
  *            - HSI 16MHz, PLL OFF
  * @note   This function doesn't modify the configuration of the
  *            - Peripheral clocks
  *            - LSI and LSE clocks
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCC_DeInit(void)
{
  uint32_t tickstart;
  uint32_t vl_mask;

  /* If DIRECT_HSE configuration is enabled we need to re-enable the HSI */
  if (LL_RCC_DIRECT_HSE_IsEnabled())
  {
    LL_RCC_DIRECT_HSE_Disable();
  }

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Disable the HSE clock source */
  __HAL_RCC_HSE_CONFIG(RCC_HSE_OFF);

  /* Wait for HSE READY bit to be reset */
  while (LL_RCC_HSE_IsReady() != 0U)
  {
    if ((HAL_GetTick() - tickstart) > HSE_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Disable the RC64MPLL clock source */
  LL_RCC_RC64MPLL_Disable();

